{
  "story": {
    "leadText": "Passionate developer with a love for creating meaningful digital experiences",
    "paragraphs": [
      "I'm a student developer who discovered my passion for coding through building contributory projects and solving real-world problems. What started as curiosity has become a journey of continuous learning and growth.",
      "I believe in writing clean, maintainable code and creating user experiences that are both beautiful and functional. When I'm not coding, you can find me exploring new technologies, contributing to open-source projects, or sharing knowledge with the developer community."
    ]
  },
  "goals": [
    {
      "title": "Build Innovative Solutions",
      "description": "Create web applications that make a positive impact on users' lives"
    },
    {
      "title": "Contribute to Open Source",
      "description": "Give back to the community by sharing knowledge and code"
    },
    {
      "title": "Master Modern Technologies",
      "description": "Continuously learn and stay updated with the latest tech trends"
    },
    {
      "title": "Collaborate Globally",
      "description": "Work with diverse teams and learn from different perspectives"
    }
  ],
  "quickFacts": [
    "3+ years of coding experience",
    "Passionate about clean code",
    "Open source contributor"
  ],
  "currentFocus": "Currently exploring advanced Vue.js patterns, TypeScript integration, and performance optimization techniques.",
  "hobbies": "When I'm not coding, I enjoy photography, hiking, and reading tech blogs.",
  "updates": [
    {
      "id": 1,
      "date": "2025-11-10",
      "title": "🎉 New Portfolio Launched",
      "description": "Just launched my new personal portfolio website built with Vue 3 and Vite!",
      "link": null
    },
    {
      "id": 2,
      "date": "2025-11-08",
      "title": "📝 Published New Blog Post",
      "description": "Wrote about my experience training LLM to detect species.",
      "link": "/blog/ai-forest-ranger-hangzhou"
    },
    {
      "id": 3,
      "date": "2025-04-23",
      "title": "🐌 Completed Eco Protect Project",
      "description": "Finished a AI powered Golden Apple Snail egg detect application with GUI",
      "link": "/projects/3"
    }
  ]
}
