[
  {
    "id": 1,
    "title": "GLM-Edge-V-2B Species Monitoring System",
    "introduction": "An AI-powered egg cluster detection system for invasive Golden Apple Snail using multimodal large language model",
    "image": "https://img01.71360.com/file/read/www2/M00/2A/81/wKj2K2L8sd2ASuLwAAFZi5VLq-E559.jpg",
    "githubUrl": "https://github.com/dengruihan/GLM-Edge-V-2B--Monitoring_Species",
    "techStack": [
      "GLM-Edge-V-2B",
      "Python",
      "Computer Vision",
      "Drone Imaging",
      "Multimodal AI"
    ],
    "details": "A comprehensive species monitoring system that utilizes the GLM-Edge-V-2B multimodal large language model to automatically detect Golden Apple Snail egg clusters from drone-captured images with over 90% accuracy. The system supports ecological monitoring staff in Hangzhou's scenic reserves by enabling rapid egg density assessments, improving conservation planning. Features include real-time image analysis, batch processing capabilities, and a user-friendly web interface for both technical and non-technical users."
  },
  {
    "id": 2,
    "title": "Color-Based Detection Algorithm",
    "introduction": "A lightweight computer vision approach for rapid Golden Apple Snail egg identification",
    "image": "https://picsum.photos/seed/color-detection/400/300.jpg",
    "githubUrl": "https://github.com/dengruihan/GLM-Edge-V-2B--Monitoring_Species",
    "liveDemoUrl": "https://www.goldenapplesnail.top",
    "techStack": [
      "OpenCV",
      "Python",
      "HSV Color Space",
      "Image Processing",
      "Computer Vision"
    ],
    "details": "An efficient color-based detection algorithm that identifies Golden Apple Snail eggs using HSV color range analysis. The system processes 5,000 images in just 2 seconds with approximately 75% accuracy. Features include adaptive color range selection for different lighting conditions, optimized pixel size thresholds, and mask calculation modules for precise egg counting. Ideal for rapid assessments in simple natural environments with minimal computational requirements."
  },
  {
    "id": 3,
    "title": "Ecological Awareness Platform",
    "introduction": "Community engagement and educational platform for invasive species awareness",
    "image": "https://picsum.photos/seed/ecological-platform/400/300.jpg",
    "githubUrl": "https://github.com/dengruihan/GLM-Edge-V-2B--Monitoring_Species",
    "liveDemoUrl": "https://www.goldenapplesnail.top",
    "techStack": [
      "Web Development",
      "UI/UX Design",
      "Mobile Responsive",
      "Educational Content",
      "Community Outreach"
    ],
    "details": "A comprehensive web platform that combines species detection technology with public education and community engagement. Features include user-friendly image upload interface, batch processing capabilities, educational content about invasive species, mobile-responsive design for field use, and cartoon-style illustrations to raise awareness. The platform has successfully engaged over 100 visitors during school open days and serves as a bridge between scientific research and public participation in ecological protection."
  }
]
